In [1]:
#importing library
import pandas as pd

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
df.shape

(0, 0)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [5]:
city = ['Dhaka', 'Rajshahi', 'Sylhet']
city

['Dhaka', 'Rajshahi', 'Sylhet']

In [6]:
#converting list to DataFrame
df = pd.DataFrame(city)
df

          0
0     Dhaka
1  Rajshahi
2    Sylhet

In [7]:
df.shape

(3, 1)

In [8]:
row, col = df.shape

In [9]:
row

3

In [10]:
col

1

In [13]:
df = pd.DataFrame(city, columns=['Big_city_BD'], index=['c1','c2','c3'])
df

   Big_city_BD
c1       Dhaka
c2    Rajshahi
c3      Sylhet

In [14]:
city2 = ['Rangpur', 'Mymensingh', 'Khulna']
city2

['Rangpur', 'Mymensingh', 'Khulna']

In [16]:
df2 = pd.DataFrame(zip(city,city2), columns=['Big_city_BD_1','Big_city_BD_2'], index=['c1', 'c2', 'c3'])
df2

   Big_city_BD_1 Big_city_BD_2
c1         Dhaka       Rangpur
c2      Rajshahi    Mymensingh
c3        Sylhet        Khulna

In [17]:
df.shape

(3, 1)

In [18]:
df2.shape

(3, 2)

In [20]:
city

['Dhaka', 'Rajshahi', 'Sylhet']

In [21]:
city2

['Rangpur', 'Mymensingh', 'Khulna']

In [22]:
dict1 = {
    'city1': city,
    'city2': city2
}

In [23]:
dict1

{'city1': ['Dhaka', 'Rajshahi', 'Sylhet'],
 'city2': ['Rangpur', 'Mymensingh', 'Khulna']}

In [24]:
df5 = pd.DataFrame(dict1)
df5

      city1       city2
0     Dhaka     Rangpur
1  Rajshahi  Mymensingh
2    Sylhet      Khulna

In [25]:
type(dict1)

dict

In [26]:
#importing csv file
df = pd.read_csv('Demo_Data_Sheet.csv')

In [27]:
df

   SL       Date  Day  Total Screen Time  Reference  Productivity
0   1   7-Jun-23  Wed                187         33            22
1   2   8-Jun-23  Thu                111         45             4
2   3   9-Jun-23  Fri                133         78            44
3   4  10-Jun-23  Sat                134         68            37
4   5  11-Jun-23  Sun                178         44             4
5   6  12-Jun-23  Mon                345         27             5
6   7  13-Jun-23  Tue                541         46            17
7   8  14-Jun-23  Wed                734         89            11
8   9  15-Jun-23  Thu                356          3            26
9  10  16-Jun-23  Fri                990         34            13

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
df.head()

   SL       Date  Day  Total Screen Time  Reference  Productivity
0   1   7-Jun-23  Wed                187         33            22
1   2   8-Jun-23  Thu                111         45             4
2   3   9-Jun-23  Fri                133         78            44
3   4  10-Jun-23  Sat                134         68            37
4   5  11-Jun-23  Sun                178         44             4

In [30]:
df.tail()

   SL       Date  Day  Total Screen Time  Reference  Productivity
5   6  12-Jun-23  Mon                345         27             5
6   7  13-Jun-23  Tue                541         46            17
7   8  14-Jun-23  Wed                734         89            11
8   9  15-Jun-23  Thu                356          3            26
9  10  16-Jun-23  Fri                990         34            13

In [31]:
df.head(6)

   SL       Date  Day  Total Screen Time  Reference  Productivity
0   1   7-Jun-23  Wed                187         33            22
1   2   8-Jun-23  Thu                111         45             4
2   3   9-Jun-23  Fri                133         78            44
3   4  10-Jun-23  Sat                134         68            37
4   5  11-Jun-23  Sun                178         44             4
5   6  12-Jun-23  Mon                345         27             5

In [33]:
df.values

array([[1, '7-Jun-23', 'Wed', 187, 33, 22],
       [2, '8-Jun-23', 'Thu', 111, 45, 4],
       [3, '9-Jun-23', 'Fri', 133, 78, 44],
       [4, '10-Jun-23', 'Sat', 134, 68, 37],
       [5, '11-Jun-23', 'Sun', 178, 44, 4],
       [6, '12-Jun-23', 'Mon', 345, 27, 5],
       [7, '13-Jun-23', 'Tue', 541, 46, 17],
       [8, '14-Jun-23', 'Wed', 734, 89, 11],
       [9, '15-Jun-23', 'Thu', 356, 3, 26],
       [10, '16-Jun-23', 'Fri', 990, 34, 13]], dtype=object)

In [34]:
df.columns

Index(['SL', 'Date', 'Day', 'Total Screen Time', 'Reference', 'Productivity'], dtype='object')

In [35]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [36]:
df.Date

0     7-Jun-23
1     8-Jun-23
2     9-Jun-23
3    10-Jun-23
4    11-Jun-23
5    12-Jun-23
6    13-Jun-23
7    14-Jun-23
8    15-Jun-23
9    16-Jun-23
Name: Date, dtype: object

In [38]:
df[['Total Screen Time']]

   Total Screen Time
0                187
1                111
2                133
3                134
4                178
5                345
6                541
7                734
8                356
9                990

In [43]:
df.Date.head()

0     7-Jun-23
1     8-Jun-23
2     9-Jun-23
3    10-Jun-23
4    11-Jun-23
Name: Date, dtype: object

In [45]:
df[['Date']].head()

        Date
0   7-Jun-23
1   8-Jun-23
2   9-Jun-23
3  10-Jun-23
4  11-Jun-23

In [47]:
df[['SL','Date','Reference']].head(6)

   SL       Date  Reference
0   1   7-Jun-23         33
1   2   8-Jun-23         45
2   3   9-Jun-23         78
3   4  10-Jun-23         68
4   5  11-Jun-23         44
5   6  12-Jun-23         27